<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 日志记录方式，内置 file socket 支持扩展
    'type'         => 'File',
    // 日志保存目录
    'path'         => '',
    // 日志记录级别
    'level'        => ['sql', 'error'],
    'record_trace' => 'true',
    //apart_level设置后，就会单独生成sql这个类型的日志文件，主日志文件中将不再包含这个级别的日志信息。

    'apart_level'   =>  ['sql', 'error'],
];
